---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSetIterator.#ctor
source: html/2f0e3747-a3f1-ccaa-714f-e562972749e1.htm
---
# Autodesk.Revit.DB.Electrical.WireSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public WireSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.